Proyectos Trabajos/Broxel/Core-Process/Documentacion/Archivos Respaldo/GeneralAccountServiceRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:ps="http://schemas.datacontract.org/2004/07/PS.IssuerCustomer.ClientWS.Contract.DataTypes" xmlns:ps1="http://schemas.datacontract.org/2004/07/PS.IssuerCustomer.ClientWS.Contract.DataTypes.AddAccountDTO" xmlns:ps2="http://schemas.datacontract.org/2004/07/PS.IssuerCustomer.ClientWS.Contract.DataTypes.UpdateAccountCustomer">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:CreateGeneralAccount>
         <!--Optional:-->
         <tem:generalAccountAdd>
            <!--Optional:-->
            <ps:AcceptEmailAccountStatement>false</ps:AcceptEmailAccountStatement>
            <!--Optional:-->
            <!--Optional:-->
            <!--Optional:-->
            <ps:CreditCommercialConditions>
 			<ps:CloseDateCode>11</ps:CloseDateCode>
               <!--Optional:-->
               <ps:CreditLimit>1234</ps:CreditLimit>
               <!--Optional:-->
               <ps:DebitType>2</ps:DebitType>
               <!--Optional:-->
               <ps:PaymentMethod>1</ps:PaymentMethod>
               <!--Optional:-->
               <ps:SettlementModelCode>0001</ps:SettlementModelCode>
            </ps:CreditCommercialConditions>
            <!--Optional:-->
            <!--Optional:-->
            <ps:Email>esteban.cruz@broxel.com</ps:Email>
            <!--Optional:-->
            <!--Optional:-->
            <ps:GeneratePrintedAccountStatement>false</ps:GeneratePrintedAccountStatement>
            <!--Optional:-->
            <!--Optional:-->
            <ps:IssuerBranchCode>106</ps:IssuerBranchCode>
            <!--Optional:-->
            <ps:IssuerBranchGeoState>MX-DF</ps:IssuerBranchGeoState>
            <!--Optional:-->
            <ps:IssuerCode>105</ps:IssuerCode>
            <!--Optional:-->
            <ps:MainResponsible>
               <!--Optional:-->
               <ps1:Addresses>
                  <!--Zero or more repetitions:-->
                  <ps2:AddressDTO>
                     <ps2:AddressType>1</ps2:AddressType>
                     <ps2:CityCode>866</ps2:CityCode>
                     <ps2:CountryCode>484</ps2:CountryCode>
                     <ps2:DoorNumber>17</ps2:DoorNumber>
                     <ps2:GeographicCode>MX-DF</ps2:GeographicCode>
                     <ps2:Neighbourhood>Los Reyes </ps2:Neighbourhood>
                     <ps2:PostalCode>19849</ps2:PostalCode>
                     <ps2:Street>Acelopan</ps2:Street>
                     <ps2:StreetType>1</ps2:StreetType>
                  </ps2:AddressDTO>
               </ps1:Addresses>
               <!--Optional:-->
               <!--Optional:-->
               <ps1:CustomerType>1</ps1:CustomerType>
               <!--Optional:-->
               <ps1:Document>9999999999999</ps1:Document>
               <!--Optional:-->
               <ps1:DocumentTypeCode>4</ps1:DocumentTypeCode>
               <!--Optional:-->
               <ps1:FinantialRelationType>1</ps1:FinantialRelationType>
               <!--Optional:-->
               <!--Optional:-->
               <ps1:PhysicalPerson>
                  <!--Optional:-->
                  <ps1:BirthDate>25051987</ps1:BirthDate>
                  <!--Optional:-->
                  <!--Optional:-->
                  <ps1:CustomerName>PruebasTiBroxel</ps1:CustomerName>
                  <!--Optional:-->
                  <ps1:CustomerProducts>
                     <!--Zero or more repetitions:-->
                     <ps1:ProductDTO>
                        <!--Optional:-->
                        <ps1:AffinityGroupCode>9999</ps1:AffinityGroupCode>
                        <ps1:ProductCode>BCE000</ps1:ProductCode>
                        <!--Optional:-->
                        <ps1:ProductCreditLines>
                           <!--Zero or more repetitions:-->
                           <ps:CreditLineDTO>
                              <!--Optional:-->
                              <ps:CreditLineCode>1</ps:CreditLineCode>
                              <!--Optional:-->
                              <ps:CreditLineValue>123</ps:CreditLineValue>
                              <!--Optional:-->
                              <ps:CreditLineValueType>F</ps:CreditLineValueType>
                           </ps:CreditLineDTO>
                           <ps:CreditLineDTO>
                              <!--Optional:-->
                              <ps:CreditLineCode>2</ps:CreditLineCode>
                              <!--Optional:-->
                              <ps:CreditLineValue>20</ps:CreditLineValue>
                              <!--Optional:-->
                              <ps:CreditLineValueType>P</ps:CreditLineValueType>
                           </ps:CreditLineDTO>
                        </ps1:ProductCreditLines>
                        <!--Optional:-->
                     </ps1:ProductDTO>
                  </ps1:CustomerProducts>
                  <!--Optional:-->
                  <ps1:CustomerSurname>PruebasBroxel</ps1:CustomerSurname>
                  <!--Optional:-->
                  <ps1:Email>esteban.cruz@broxel.com</ps1:Email>
                  <!--Optional:-->
                  <ps1:EmbossingName>PRUEBA SSN</ps1:EmbossingName>
                  <!--Optional:-->
              
                  <!--Optional:-->
                  <ps1:ExternalCustomerId>371375125</ps1:ExternalCustomerId>
                  <!--Optional:-->
                  <ps1:Gender>2</ps1:Gender>
                  <!--Optional:-->
                  <ps1:MaritalStatus>1</ps1:MaritalStatus>
                  <!--Optional:-->
                  <ps1:Nationality>484</ps1:Nationality>
                  <!--Optional:-->
                  <ps1:NumberOfChildren>2</ps1:NumberOfChildren>
                  <!--Optional:-->
                </ps1:PhysicalPerson>
               <!--Optional:-->
               <ps1:SameAddressForMailing>true</ps1:SameAddressForMailing>
               <!--Optional:-->
            </ps:MainResponsible>
            <!--Optional:-->
            <!--Optional:-->
            <!--Optional:-->
            <ps:ProductGroupCode>5</ps:ProductGroupCode>
            <!--Optional:-->
            <ps:ProductType>1</ps:ProductType>
            <!--Optional:-->
         </tem:generalAccountAdd>
      </tem:CreateGeneralAccount>
   </soapenv:Body>
</soapenv:Envelope>